In [1]:
!docker run --name my-postgres -e POSTGRES_PASSWORD=mysecretpassword -p 15432:5432 -d postgres:13

b08a402683a29b05756a3ceaeb6c03a1411adc7d55b31c084c04c42338e7a672

In [10]:
!pip install sqlalchemy psycopg2-binary

Requirement already satisfied: sqlalchemy in /Users/dante/miniconda3/lib/python3.12/site-packages (2.0.38)
Requirement already satisfied: psycopg2-binary in /Users/dante/miniconda3/lib/python3.12/site-packages (2.9.9)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/dante/miniconda3/lib/python3.12/site-packages (from sqlalchemy) (4.13.2)

In [2]:
### **1. 사용자별 총 주문 금액 계산**
#  - 각 사용자의 총 주문 횟수와 총 지출 금액을 확인할 수 있는 쿼리를 작성해주세요

In [3]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:mysecretpassword@localhost:15432/postgres')

In [7]:
import pandas as pd
users = pd.read_sql_table('users', engine, schema='public')
users.head()

   user_id registration_date user_type     city      country
0        1        2022-01-05   REGULAR    Seoul  South Korea
1        2        2022-02-15   PREMIUM    Busan  South Korea
2        3        2022-03-22   REGULAR  Incheon  South Korea
3        4        2022-01-30   PREMIUM    Daegu  South Korea
4        5        2022-04-10   REGULAR  Gwangju  South Korea

In [8]:
orders = pd.read_sql_table('orders', engine)
orders.head()

,order_id,user_id,order_date,total_amount,payment_method,order_status
0,10001,1,2023-01-05 14:32:15,968000.0,신용카드,배송완료
1,10002,3,2023-01-07 10:15:22,199000.0,계좌이체,배송완료
2,10003,5,2023-01-10 16:45:33,129000.0,신용카드,배송완료
3,10004,2,2023-01-15 09:22:18,1299000.0,신용카드,배송완료
4,10005,7,2023-01-18 11:33:45,108000.0,간편결제,배송완료

In [ ]:
users.set_index('user_id', inplace=True)
orders.set_index('user_id', inplace=True)

In [14]:
merge_df = users.join(orders, how='left')
merge_df.head()

,registration_date,user_type,city,country,order_id,order_date,total_amount,payment_method,order_status
user_id,,,,,,,,,
1,2022-01-05,REGULAR,Seoul,South Korea,10001,2023-01-05 14:32:15,968000.0,신용카드,배송완료
1,2022-01-05,REGULAR,Seoul,South Korea,10016,2023-02-28 12:12:50,399000.0,신용카드,배송완료
1,2022-01-05,REGULAR,Seoul,South Korea,10032,2023-05-04 14:20:15,1599000.0,신용카드,배송완료
1,2022-01-05,REGULAR,Seoul,South Korea,10061,2023-08-28 15:15:15,129000.0,신용카드,배송완료
1,2022-01-05,REGULAR,Seoul,South Korea,10085,2023-12-02 10:20:15,1599000.0,신용카드,배송완료

In [16]:
merge_df.groupby('user_id').agg(
    total_ord_cnt=('order_id', 'count'),
    total_amt=('total_amount', 'sum')
).head(10)

         total_ord_cnt  total_amt
user_id
1                    6  5593000.0
2                    7  9452000.0
3                    6  2532000.0
4                    6  1301000.0
5                    6  1553000.0
6                    6  4834000.0
7                    6   773000.0
8                    6   533000.0
9                    6  6443000.0
10                   6  5374000.0

In [17]:
## **2. 카테고리별 제품 판매량 및 매출액 분석**

# - 각 카테고리별 판매된 제품의 총 수량과 총 매출액을 확인할 수 있는 쿼리를 작성해주세요

In [18]:
products = pd.read_sql_table('products', engine)
products.head()

,product_id,product_name,category_id,price,stock_quantity,added_date,supplier_id
0,101,프리미엄 4K 스마트 TV 55인치,2,899000.0,50,2023-01-15,4
1,102,울트라 HD 스마트 TV 65인치,2,1299000.0,35,2023-02-05,4
2,103,초소형 전자레인지 20L,2,89000.0,120,2023-01-20,6
3,104,스마트 로봇 청소기,2,459000.0,80,2023-03-10,4
4,105,고효율 냉장고 500L,2,1599000.0,25,2023-02-12,4

In [21]:
order_items = pd.read_sql_table('order_items', engine)
order_items.head()

   order_item_id  order_id  product_id  quantity  price_per_unit  discount
0           1001     10001         201         1        899000.0       0.0
1           1002     10001         305         2         35000.0    1000.0
2           1003     10002         303         1        199000.0       0.0
3           1004     10003         704         1        129000.0       0.0
4           1005     10004         301         1       1299000.0       0.0

In [23]:
orders.set_index('order_id', inplace=True)
order_items.set_index('order_id', inplace=True)

In [24]:
order_order_items = orders.join(order_items, how='left')
order_order_items.head()

,order_date,total_amount,payment_method,order_status,order_item_id,product_id,quantity,price_per_unit,discount
order_id,,,,,,,,,
10001,2023-01-05 14:32:15,968000.0,신용카드,배송완료,1001,201,1,899000.0,0.0
10001,2023-01-05 14:32:15,968000.0,신용카드,배송완료,1002,305,2,35000.0,1000.0
10002,2023-01-07 10:15:22,199000.0,계좌이체,배송완료,1003,303,1,199000.0,0.0
10003,2023-01-10 16:45:33,129000.0,신용카드,배송완료,1004,704,1,129000.0,0.0
10004,2023-01-15 09:22:18,1299000.0,신용카드,배송완료,1005,301,1,1299000.0,0.0

In [25]:
order_order_items.set_index('product_id', inplace=True)
products.set_index('product_id', inplace=True)

In [30]:
merge_df2 = order_order_items.join(products, how='right')
merge_df2['net_amount'] = merge_df2.apply(lambda row : row['total_amount'] - row['discount'], axis=1)
merge_df2.head()

,order_date,total_amount,payment_method,order_status,order_item_id,quantity,price_per_unit,discount,product_name,category_id,price,stock_quantity,added_date,supplier_id,net_amount
product_id,,,,,,,,,,,,,,,
101,2023-02-21 10:10:15,899000.0,계좌이체,배송완료,1021.0,1.0,899000.0,0.0,프리미엄 4K 스마트 TV 55인치,2,899000.0,50,2023-01-15,4,899000.0
101,2023-05-20 13:25:10,899000.0,신용카드,배송완료,1048.0,1.0,899000.0,0.0,프리미엄 4K 스마트 TV 55인치,2,899000.0,50,2023-01-15,4,899000.0
101,2023-08-20 10:30:10,899000.0,신용카드,배송완료,1084.0,1.0,899000.0,0.0,프리미엄 4K 스마트 TV 55인치,2,899000.0,50,2023-01-15,4,899000.0
101,2023-11-20 10:15:10,899000.0,신용카드,배송완료,1116.0,1.0,899000.0,0.0,프리미엄 4K 스마트 TV 55인치,2,899000.0,50,2023-01-15,4,899000.0
101,2024-01-19 13:35:10,899000.0,신용카드,배송완료,1140.0,1.0,899000.0,0.0,프리미엄 4K 스마트 TV 55인치,2,899000.0,50,2023-01-15,4,899000.0

In [31]:
merge_df2.groupby('category_id').agg(
    total_ord_cnt=('quantity', 'sum'),
    net_amt=('net_amount', 'sum')
)

             total_ord_cnt     net_amt
category_id
2                     25.0  19981000.0
3                     14.0  13895000.0
4                     23.0  14774000.0
6                     30.0   4474000.0
7                      7.0   1015000.0
11                    13.0   5977000.0
12                    17.0   3156000.0
15                    60.0   5808000.0
20                    43.0   3418000.0